vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/PWR_registers.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the PWR register type definitions for the stm32h503 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "PWR_index.h"


typedef union {
	struct {
		uint32_t LPMS          : 1; 
		uint32_t _reserved1    : 1;
		uint32_t SVOS          : 2; 
		uint32_t _reserved4    : 3;
		uint32_t CSSF          : 1; 
		uint32_t _reserved8    : 1;
		uint32_t FLPS          : 1; 
		uint32_t _reserved10   : 2;
		uint32_t BOOSTE        : 1; 
		uint32_t AVD_READY     : 1; 
		uint32_t _reserved14   :11;
		uint32_t SRAM2SO       : 1; 
		uint32_t SRAM1SO       : 1; 
		uint32_t _reserved27   : 5;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,pmcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,pmcr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 5;
		uint32_t STOPF         : 1; 
		uint32_t SBF           : 1; 
		uint32_t _reserved7    :25;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,pmsr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,pmsr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 4;
		uint32_t VOS           : 2; 
		uint32_t _reserved6    :26;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,voscr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,voscr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 3;
		uint32_t VOSRDY        : 1; 
		uint32_t _reserved4    : 9;
		uint32_t ACTVOSRDY     : 1; 
		uint32_t ACTVOS        : 2; 
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,vossr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,vossr),bits);

typedef union {
	struct {
		uint32_t BREN          : 1; 
		uint32_t MONEN         : 1; 
		uint32_t _reserved2    : 6;
		uint32_t VBE           : 1; 
		uint32_t VBRS          : 1; 
		uint32_t _reserved10   :22;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,bdcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,bdcr),bits);

typedef union {
	struct {
		uint32_t DBP           : 1; 
		uint32_t _reserved1    :31;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,dbpcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,dbpcr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :16;
		uint32_t BRRDY         : 1; 
		uint32_t _reserved17   : 3;
		uint32_t VBATL         : 1; 
		uint32_t VBATH         : 1; 
		uint32_t TEMPL         : 1; 
		uint32_t TEMPH         : 1; 
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,bdsr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,bdsr),bits);

typedef union {
	struct {
		uint32_t BYPASS        : 1; 
		uint32_t _reserved1    : 7;
		uint32_t LDOEN         : 1; 
		uint32_t _reserved9    :23;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,sccr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,sccr),bits);

typedef union {
	struct {
		uint32_t PVDEN         : 1; 
		uint32_t PLS           : 3; 
		uint32_t _reserved4    : 4;
		uint32_t AVDEN         : 1; 
		uint32_t ALS           : 2; 
		uint32_t _reserved11   :21;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,vmcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,vmcr),bits);

typedef union {
	struct {
		uint32_t _reserved0    :19;
		uint32_t AVDO          : 1; 
		uint32_t VDDIO2RDY     : 1; 
		uint32_t _reserved21   : 1;
		uint32_t PVDO          : 1; 
		uint32_t _reserved23   : 9;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,vmsr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,vmsr),bits);

typedef union {
	struct {
		uint32_t CWUF1         : 1; 
		uint32_t CWUF2         : 1; 
		uint32_t CWUF3         : 1; 
		uint32_t CWUF4         : 1; 
		uint32_t CWUF5         : 1; 
		uint32_t _reserved5    :27;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,wuscr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,wuscr),bits);

typedef union {
	struct {
		uint32_t WUF1          : 1; 
		uint32_t WUF2          : 1; 
		uint32_t WUF3          : 1; 
		uint32_t WUF4          : 1; 
		uint32_t WUF5          : 1; 
		uint32_t _reserved5    :27;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,wusr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,wusr),bits);

typedef union {
	struct {
		uint32_t WUPEN1        : 1; 
		uint32_t WUPEN2        : 1; 
		uint32_t WUPEN3        : 1; 
		uint32_t WUPEN4        : 1; 
		uint32_t WUPEN5        : 1; 
		uint32_t _reserved5    : 3;
		uint32_t WUPP1         : 1; 
		uint32_t WUPP2         : 1; 
		uint32_t WUPP3         : 1; 
		uint32_t WUPP4         : 1; 
		uint32_t WUPP5         : 1; 
		uint32_t _reserved13   : 3;
		uint32_t WUPPUPD1      : 2; 
		uint32_t WUPPUPD2      : 2; 
		uint32_t WUPPUPD3      : 2; 
		uint32_t WUPPUPD4      : 2; 
		uint32_t WUPPUPD5      : 2; 
		uint32_t _reserved26   : 6;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,wucr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,wucr),bits);

typedef union {
	struct {
		uint32_t IORETEN       : 1; 
		uint32_t _reserved1    :15;
		uint32_t JTAGIORETEN   : 1; 
		uint32_t _reserved17   :15;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,ioretr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,ioretr),bits);

typedef union {
	struct {
		uint32_t _reserved0    : 1;
		uint32_t PRIV          : 1; 
		uint32_t _reserved2    :30;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(h503_pwr,privcfgr);
CHECK_TYPEDEF_u32(REGDEF_NAME(h503_pwr,privcfgr),bits);

static const stm32_reginfo_t stm32_h503_pwr_reginfo[RI_END] =
{
	[RI_PMCR           ] = { .reset_val = 0x0000000C, .not_reserved = true, .unimp_mask = 0x0600328D, .mask = 0x0600328D }, /* mask = 0b00000110000000000011001010001101 */
	[RI_PMSR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000060, .mask = 0x00000060 }, /* mask = 0b00000000000000000000000001100000 */
	[RI_VOSCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000030, .mask = 0x00000030 }, /* mask = 0b00000000000000000000000000110000 */
	[RI_VOSSR          ] = { .reset_val = 0x00002008, .not_reserved = true, .unimp_mask = 0x0000E008, .mask = 0x0000E008 }, /* mask = 0b00000000000000001110000000001000 */
	[RI_BDCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000303, .mask = 0x00000303 }, /* mask = 0b00000000000000000000001100000011 */
	[RI_DBPCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000001, .mask = 0x00000001 }, /* mask = 0b00000000000000000000000000000001 */
	[RI_BDSR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00F10000, .mask = 0x00F10000 }, /* mask = 0b00000000111100010000000000000000 */
	[RI_SCCR           ] = { .reset_val = 0x00000100, .not_reserved = true, .unimp_mask = 0x00000101, .mask = 0x00000101 }, /* mask = 0b00000000000000000000000100000001 */
	[RI_VMCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000070F, .mask = 0x0000070F }, /* mask = 0b00000000000000000000011100001111 */
	[RI_VMSR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00580000, .mask = 0x00580000 }, /* mask = 0b00000000010110000000000000000000 */
	[RI_WUSCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000001F, .mask = 0x0000001F }, /* mask = 0b00000000000000000000000000011111 */
	[RI_WUSR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x0000001F, .mask = 0x0000001F }, /* mask = 0b00000000000000000000000000011111 */
	[RI_WUCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x03FF1F1F, .mask = 0x03FF1F1F }, /* mask = 0b00000011111111110001111100011111 */
	[RI_IORETR         ] = { .reset_val = 0x00010001, .not_reserved = true, .unimp_mask = 0x00010001, .mask = 0x00010001 }, /* mask = 0b00000000000000010000000000000001 */
	[RI_PRIVCFGR       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000002, .mask = 0x00000002 }, /* mask = 0b00000000000000000000000000000010 */
};

typedef union {
	struct {
		REGDEF_NAME(h503_pwr,pmcr) PMCR;
		REGDEF_NAME(h503_pwr,pmsr) PMSR;
		uint32_t _reserved0x8[ 2];
		REGDEF_NAME(h503_pwr,voscr) VOSCR;
		REGDEF_NAME(h503_pwr,vossr) VOSSR;
		uint32_t _reserved0x18[ 2];
		REGDEF_NAME(h503_pwr,bdcr) BDCR;
		REGDEF_NAME(h503_pwr,dbpcr) DBPCR;
		REGDEF_NAME(h503_pwr,bdsr) BDSR;
		uint32_t _reserved0x2C;
		REGDEF_NAME(h503_pwr,sccr) SCCR;
		REGDEF_NAME(h503_pwr,vmcr) VMCR;
		uint32_t _reserved0x38;
		REGDEF_NAME(h503_pwr,vmsr) VMSR;
		REGDEF_NAME(h503_pwr,wuscr) WUSCR;
		REGDEF_NAME(h503_pwr,wusr) WUSR;
		REGDEF_NAME(h503_pwr,wucr) WUCR;
		uint32_t _reserved0x4C;
		REGDEF_NAME(h503_pwr,ioretr) IORETR;
		uint32_t _reserved0x54[44];
		REGDEF_NAME(h503_pwr,privcfgr) PRIVCFGR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(h503,pwr);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(h503,pwr)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), PMCR) != 0, "Offset mismatch for PMCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), PMSR) != 4, "Offset mismatch for PMSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), VOSCR) != 16, "Offset mismatch for VOSCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), VOSSR) != 20, "Offset mismatch for VOSSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), BDCR) != 32, "Offset mismatch for BDCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), DBPCR) != 36, "Offset mismatch for DBPCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), BDSR) != 40, "Offset mismatch for BDSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), SCCR) != 48, "Offset mismatch for SCCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), VMCR) != 52, "Offset mismatch for VMCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), VMSR) != 60, "Offset mismatch for VMSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), WUSCR) != 64, "Offset mismatch for WUSCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), WUSR) != 68, "Offset mismatch for WUSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), WUCR) != 72, "Offset mismatch for WUCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), IORETR) != 80, "Offset mismatch for IORETR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(h503,pwr), PRIVCFGR) != 260, "Offset mismatch for PRIVCFGR");
